mysql_cluster_benchmark_results.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Target transaction rate: 40/sec
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 40.89 qps: 817.88 (r/w/o: 572.52/163.58/81.79) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 1s ] queue length: 0, concurrency: 0
[ 2s ] thds: 8 tps: 36.02 qps: 739.33 (r/w/o: 518.23/148.07/73.03) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 1
[ 3s ] thds: 8 tps: 28.00 qps: 579.08 (r/w/o: 406.06/116.02/57.01) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 3s ] queue length: 0, concurrency: 2
[ 4s ] thds: 8 tps: 44.00 qps: 841.92 (r/w/o: 587.95/167.98/85.99) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 0
[ 5s ] thds: 8 tps: 50.00 qps: 1000.01 (r/w/o: 700.01/200.00/100.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 5s ] queue length: 0, concurrency: 0
[ 6s ] thds: 8 tps: 40.00 qps: 800.01 (r/w/o: 560.01/160.00/80.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 0
[ 7s ] thds: 8 tps: 32.00 qps: 640.00 (r/w/o: 448.00/128.00/64.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 7s ] queue length: 0, concurrency: 0
[ 8s ] thds: 8 tps: 39.00 qps: 780.01 (r/w/o: 546.01/156.00/78.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 0
[ 9s ] thds: 8 tps: 35.00 qps: 699.98 (r/w/o: 489.98/140.00/70.00) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 9s ] queue length: 0, concurrency: 0
[ 10s ] thds: 8 tps: 44.00 qps: 880.03 (r/w/o: 616.02/176.01/88.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 0
[ 11s ] thds: 8 tps: 36.00 qps: 748.01 (r/w/o: 530.01/144.00/74.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 11s ] queue length: 0, concurrency: 2
[ 12s ] thds: 8 tps: 42.00 qps: 812.01 (r/w/o: 562.01/168.00/82.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 0
[ 13s ] thds: 8 tps: 35.00 qps: 731.98 (r/w/o: 515.98/144.00/72.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 13s ] queue length: 0, concurrency: 2
[ 14s ] thds: 8 tps: 50.00 qps: 967.93 (r/w/o: 673.95/195.98/97.99) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 1, concurrency: 0
[ 15s ] thds: 8 tps: 42.00 qps: 840.05 (r/w/o: 588.04/168.01/84.01) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 15s ] queue length: 0, concurrency: 0
[ 16s ] thds: 8 tps: 31.00 qps: 653.01 (r/w/o: 461.01/128.00/64.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 2
[ 17s ] thds: 8 tps: 39.00 qps: 766.02 (r/w/o: 533.01/156.00/77.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 17s ] queue length: 0, concurrency: 1
[ 18s ] thds: 8 tps: 36.00 qps: 720.01 (r/w/o: 504.01/144.00/72.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 1
[ 19s ] thds: 8 tps: 39.00 qps: 760.95 (r/w/o: 531.97/151.99/77.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 19s ] queue length: 0, concurrency: 0
[ 20s ] thds: 8 tps: 48.00 qps: 960.03 (r/w/o: 672.02/192.01/96.00) lat (ms,95%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 0
[ 21s ] thds: 8 tps: 52.00 qps: 1039.98 (r/w/o: 727.99/208.00/104.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 21s ] queue length: 0, concurrency: 0
[ 22s ] thds: 8 tps: 34.00 qps: 711.02 (r/w/o: 504.02/137.00/70.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 2
[ 23s ] thds: 8 tps: 44.00 qps: 867.94 (r/w/o: 601.96/178.99/86.99) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 23s ] queue length: 0, concurrency: 1
[ 24s ] thds: 8 tps: 40.00 qps: 800.00 (r/w/o: 560.00/160.00/80.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 1
[ 25s ] thds: 8 tps: 32.00 qps: 621.01 (r/w/o: 434.01/124.00/63.00) lat (ms,95%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 25s ] queue length: 0, concurrency: 0
[ 26s ] thds: 8 tps: 31.00 qps: 620.00 (r/w/o: 434.00/124.00/62.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 0
[ 27s ] thds: 8 tps: 49.00 qps: 979.99 (r/w/o: 685.99/196.00/98.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 27s ] queue length: 0, concurrency: 0
[ 28s ] thds: 8 tps: 39.00 qps: 799.00 (r/w/o: 560.00/160.00/79.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 1
[ 29s ] thds: 8 tps: 31.00 qps: 620.01 (r/w/o: 434.01/124.00/62.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 29s ] queue length: 0, concurrency: 1
[ 30s ] thds: 8 tps: 39.00 qps: 761.04 (r/w/o: 532.02/152.01/77.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 0
[ 31s ] thds: 8 tps: 37.00 qps: 739.97 (r/w/o: 517.98/147.99/74.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 31s ] queue length: 0, concurrency: 0
[ 32s ] thds: 8 tps: 43.00 qps: 859.92 (r/w/o: 601.94/171.98/85.99) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 0
[ 33s ] thds: 8 tps: 44.00 qps: 888.07 (r/w/o: 623.05/176.01/89.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 33s ] queue length: 0, concurrency: 1
[ 34s ] thds: 8 tps: 42.00 qps: 847.99 (r/w/o: 595.00/169.00/84.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 1
[ 35s ] thds: 8 tps: 36.00 qps: 704.03 (r/w/o: 490.02/143.01/71.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 35s ] queue length: 0, concurrency: 0
[ 36s ] thds: 8 tps: 37.00 qps: 739.99 (r/w/o: 517.99/148.00/74.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 0
[ 37s ] thds: 8 tps: 29.00 qps: 580.01 (r/w/o: 406.01/116.00/58.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 37s ] queue length: 0, concurrency: 0
[ 38s ] thds: 8 tps: 38.00 qps: 759.94 (r/w/o: 531.96/151.99/75.99) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 0
[ 39s ] thds: 8 tps: 44.00 qps: 880.04 (r/w/o: 616.03/176.01/88.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 39s ] queue length: 0, concurrency: 0
[ 40s ] thds: 8 tps: 58.00 qps: 1175.99 (r/w/o: 825.99/233.00/117.00) lat (ms,95%): 16.12 err/s: 1.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 0
[ 41s ] thds: 8 tps: 42.00 qps: 859.02 (r/w/o: 602.02/172.00/85.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 41s ] queue length: 0, concurrency: 1
[ 42s ] thds: 8 tps: 34.00 qps: 660.99 (r/w/o: 461.99/132.00/67.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 0
[ 43s ] thds: 8 tps: 43.00 qps: 860.04 (r/w/o: 602.03/172.01/86.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 43s ] queue length: 0, concurrency: 0
[ 44s ] thds: 8 tps: 31.00 qps: 619.94 (r/w/o: 433.96/123.99/61.99) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 0
[ 45s ] thds: 8 tps: 36.00 qps: 720.01 (r/w/o: 504.01/144.00/72.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 45s ] queue length: 0, concurrency: 1
[ 46s ] thds: 8 tps: 45.00 qps: 900.05 (r/w/o: 630.03/180.01/90.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 0
[ 47s ] thds: 8 tps: 36.00 qps: 738.98 (r/w/o: 517.99/148.00/73.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 47s ] queue length: 0, concurrency: 1
[ 48s ] thds: 8 tps: 43.00 qps: 859.98 (r/w/o: 601.99/172.00/86.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 1
[ 49s ] thds: 8 tps: 47.00 qps: 921.05 (r/w/o: 644.04/184.01/93.01) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 49s ] queue length: 0, concurrency: 0
[ 50s ] thds: 8 tps: 44.00 qps: 898.99 (r/w/o: 630.00/180.00/89.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 1
[ 51s ] thds: 8 tps: 33.00 qps: 640.97 (r/w/o: 447.98/127.99/65.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 51s ] queue length: 0, concurrency: 0
[ 52s ] thds: 8 tps: 27.00 qps: 540.04 (r/w/o: 378.03/108.01/54.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 0
[ 53s ] thds: 8 tps: 39.00 qps: 779.97 (r/w/o: 545.98/155.99/78.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 53s ] queue length: 0, concurrency: 0
[ 54s ] thds: 8 tps: 45.00 qps: 914.10 (r/w/o: 643.07/180.02/91.01) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 1
[ 55s ] thds: 8 tps: 37.00 qps: 744.93 (r/w/o: 518.95/151.99/73.99) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 55s ] queue length: 0, concurrency: 1
[ 56s ] thds: 8 tps: 45.00 qps: 880.97 (r/w/o: 615.98/175.99/89.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 56s ] queue length: 0, concurrency: 0
[ 57s ] thds: 8 tps: 49.00 qps: 979.98 (r/w/o: 685.99/196.00/98.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 57s ] queue length: 0, concurrency: 0
[ 58s ] thds: 8 tps: 36.00 qps: 719.99 (r/w/o: 504.00/144.00/72.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 58s ] queue length: 0, concurrency: 0
[ 59s ] thds: 8 tps: 39.00 qps: 780.05 (r/w/o: 546.03/156.01/78.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 59s ] queue length: 0, concurrency: 0
[ 60s ] thds: 8 tps: 40.00 qps: 812.99 (r/w/o: 572.00/160.00/81.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 60s ] queue length: 0, concurrency: 1
[ 61s ] thds: 8 tps: 40.00 qps: 786.98 (r/w/o: 547.98/160.00/79.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 61s ] queue length: 0, concurrency: 0
[ 62s ] thds: 8 tps: 38.00 qps: 760.00 (r/w/o: 532.00/152.00/76.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 0
[ 63s ] thds: 8 tps: 43.00 qps: 878.98 (r/w/o: 615.98/176.00/87.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 63s ] queue length: 0, concurrency: 1
[ 64s ] thds: 8 tps: 43.00 qps: 854.07 (r/w/o: 600.05/168.01/86.01) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 1
[ 65s ] thds: 8 tps: 35.96 qps: 753.07 (r/w/o: 531.34/147.82/73.91) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 65s ] queue length: 0, concurrency: 3
[ 66s ] thds: 8 tps: 46.98 qps: 948.59 (r/w/o: 662.71/190.92/94.96) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 4
[ 67s ] thds: 8 tps: 40.07 qps: 764.31 (r/w/o: 529.91/157.27/77.13) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 67s ] queue length: 0, concurrency: 1
[ 68s ] thds: 8 tps: 53.00 qps: 1040.95 (r/w/o: 727.96/207.99/104.99) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 0
[ 69s ] thds: 8 tps: 40.00 qps: 818.98 (r/w/o: 573.98/164.00/81.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 69s ] queue length: 0, concurrency: 1
[ 70s ] thds: 8 tps: 44.00 qps: 861.04 (r/w/o: 602.03/172.01/87.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 0
[ 71s ] thds: 8 tps: 32.00 qps: 640.02 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 71s ] queue length: 0, concurrency: 0
[ 72s ] thds: 8 tps: 28.00 qps: 559.95 (r/w/o: 391.97/111.99/56.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 0
[ 73s ] thds: 8 tps: 36.00 qps: 739.03 (r/w/o: 518.02/148.01/73.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 73s ] queue length: 0, concurrency: 1
[ 74s ] thds: 8 tps: 48.00 qps: 941.00 (r/w/o: 658.00/188.00/95.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 0
[ 75s ] thds: 8 tps: 40.00 qps: 799.94 (r/w/o: 559.96/159.99/79.99) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 75s ] queue length: 0, concurrency: 1
[ 76s ] thds: 8 tps: 41.00 qps: 839.03 (r/w/o: 588.02/168.01/83.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 1
[ 77s ] thds: 8 tps: 31.00 qps: 617.02 (r/w/o: 434.02/121.00/62.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 77s ] queue length: 0, concurrency: 1
[ 78s ] thds: 8 tps: 44.00 qps: 889.95 (r/w/o: 625.97/174.99/89.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 2
[ 79s ] thds: 8 tps: 42.00 qps: 814.04 (r/w/o: 564.03/168.01/82.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 79s ] queue length: 0, concurrency: 0
[ 80s ] thds: 8 tps: 39.00 qps: 779.97 (r/w/o: 545.98/155.99/78.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 1
[ 81s ] thds: 8 tps: 38.00 qps: 759.98 (r/w/o: 531.98/152.00/76.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 81s ] queue length: 0, concurrency: 0
[ 82s ] thds: 8 tps: 43.00 qps: 860.05 (r/w/o: 602.04/172.01/86.01) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 0
[ 83s ] thds: 8 tps: 45.00 qps: 899.94 (r/w/o: 629.96/179.99/89.99) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 83s ] queue length: 0, concurrency: 1
[ 84s ] thds: 8 tps: 32.00 qps: 640.02 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 0
[ 85s ] thds: 8 tps: 43.00 qps: 874.04 (r/w/o: 614.03/172.01/88.00) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 85s ] queue length: 0, concurrency: 2
[ 86s ] thds: 8 tps: 37.00 qps: 726.01 (r/w/o: 506.01/148.00/72.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 0
[ 87s ] thds: 8 tps: 50.00 qps: 1025.99 (r/w/o: 723.99/200.00/102.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 87s ] queue length: 0, concurrency: 2
[ 88s ] thds: 8 tps: 45.00 qps: 874.01 (r/w/o: 606.01/180.00/88.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 0
[ 89s ] thds: 8 tps: 38.00 qps: 759.94 (r/w/o: 531.96/151.99/75.99) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 89s ] queue length: 0, concurrency: 0
[ 90s ] thds: 8 tps: 26.00 qps: 520.01 (r/w/o: 364.00/104.00/52.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 0
[ 91s ] thds: 8 tps: 40.00 qps: 897.06 (r/w/o: 638.04/173.01/86.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 91s ] queue length: 0, concurrency: 6
[ 92s ] thds: 8 tps: 39.00 qps: 682.95 (r/w/o: 467.97/142.99/71.99) lat (ms,95%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 0
[ 93s ] thds: 8 tps: 49.00 qps: 980.06 (r/w/o: 686.04/196.01/98.01) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 93s ] queue length: 0, concurrency: 0
[ 94s ] thds: 8 tps: 38.00 qps: 759.95 (r/w/o: 531.97/151.99/76.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 0
[ 95s ] thds: 8 tps: 45.00 qps: 900.98 (r/w/o: 629.99/180.00/91.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 95s ] queue length: 0, concurrency: 1
[ 96s ] thds: 8 tps: 36.00 qps: 719.04 (r/w/o: 504.03/144.01/71.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 1, concurrency: 1
[ 97s ] thds: 8 tps: 44.00 qps: 880.00 (r/w/o: 616.00/176.00/88.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 97s ] queue length: 0, concurrency: 0
[ 98s ] thds: 8 tps: 37.00 qps: 740.00 (r/w/o: 518.00/148.00/74.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 0
[ 99s ] thds: 8 tps: 38.00 qps: 760.01 (r/w/o: 532.01/152.00/76.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 99s ] queue length: 0, concurrency: 0
[ 100s ] thds: 8 tps: 39.00 qps: 779.98 (r/w/o: 545.99/156.00/78.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 0
[ 101s ] thds: 8 tps: 46.00 qps: 920.03 (r/w/o: 644.02/184.01/92.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 101s ] queue length: 0, concurrency: 0
[ 102s ] thds: 8 tps: 38.00 qps: 759.98 (r/w/o: 531.99/152.00/76.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 0
[ 103s ] thds: 8 tps: 50.00 qps: 1013.01 (r/w/o: 712.01/200.00/101.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 103s ] queue length: 0, concurrency: 1
[ 104s ] thds: 8 tps: 35.00 qps: 706.01 (r/w/o: 492.01/144.00/70.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 1
[ 105s ] thds: 8 tps: 41.00 qps: 819.95 (r/w/o: 573.96/163.99/81.99) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 105s ] queue length: 0, concurrency: 1
[ 106s ] thds: 8 tps: 38.00 qps: 755.04 (r/w/o: 531.03/148.01/76.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 1
[ 107s ] thds: 8 tps: 32.00 qps: 650.01 (r/w/o: 453.00/132.00/65.00) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 107s ] queue length: 0, concurrency: 2
[ 108s ] thds: 8 tps: 41.00 qps: 796.01 (r/w/o: 556.01/160.00/80.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 0
[ 109s ] thds: 8 tps: 39.00 qps: 780.00 (r/w/o: 546.00/156.00/78.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 109s ] queue length: 0, concurrency: 0
[ 110s ] thds: 8 tps: 36.00 qps: 720.01 (r/w/o: 504.01/144.00/72.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 0
[ 111s ] thds: 8 tps: 37.00 qps: 739.98 (r/w/o: 517.98/148.00/74.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 111s ] queue length: 0, concurrency: 0
[ 112s ] thds: 8 tps: 36.00 qps: 719.93 (r/w/o: 503.95/143.99/71.99) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 1
[ 113s ] thds: 8 tps: 46.00 qps: 970.08 (r/w/o: 685.06/189.02/96.01) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 113s ] queue length: 0, concurrency: 4
[ 114s ] thds: 8 tps: 35.00 qps: 687.97 (r/w/o: 476.98/142.99/68.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 2
[ 115s ] thds: 8 tps: 36.00 qps: 682.04 (r/w/o: 476.03/136.01/70.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 115s ] queue length: 0, concurrency: 0
[ 116s ] thds: 8 tps: 37.00 qps: 740.03 (r/w/o: 518.02/148.01/74.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 0
[ 117s ] thds: 8 tps: 42.99 qps: 878.89 (r/w/o: 615.93/175.98/86.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 117s ] queue length: 0, concurrency: 1
[ 118s ] thds: 8 tps: 43.00 qps: 873.07 (r/w/o: 616.05/170.01/87.01) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 1, concurrency: 2
[ 119s ] thds: 8 tps: 44.00 qps: 847.94 (r/w/o: 587.96/173.99/85.99) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 119s ] queue length: 0, concurrency: 1
[ 120s ] thds: 8 tps: 38.00 qps: 760.04 (r/w/o: 532.02/152.01/76.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 120s ] queue length: 1, concurrency: 0
[ 121s ] thds: 8 tps: 58.00 qps: 1160.00 (r/w/o: 812.00/232.00/116.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 121s ] queue length: 0, concurrency: 0
[ 122s ] thds: 8 tps: 48.00 qps: 959.99 (r/w/o: 671.99/192.00/96.00) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 0
[ 123s ] thds: 8 tps: 32.00 qps: 640.01 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 123s ] queue length: 0, concurrency: 0
[ 124s ] thds: 8 tps: 32.00 qps: 659.01 (r/w/o: 462.01/132.00/65.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 1
[ 125s ] thds: 8 tps: 44.00 qps: 860.93 (r/w/o: 601.95/171.99/86.99) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 125s ] queue length: 0, concurrency: 0
[ 126s ] thds: 8 tps: 43.00 qps: 879.07 (r/w/o: 616.05/176.01/87.01) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 1
[ 127s ] thds: 8 tps: 36.00 qps: 700.99 (r/w/o: 489.99/140.00/71.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 127s ] queue length: 0, concurrency: 0
[ 128s ] thds: 8 tps: 39.00 qps: 779.99 (r/w/o: 545.99/156.00/78.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 0
[ 129s ] thds: 8 tps: 35.00 qps: 699.99 (r/w/o: 489.99/140.00/70.00) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 129s ] queue length: 0, concurrency: 0
[ 130s ] thds: 8 tps: 31.00 qps: 639.02 (r/w/o: 448.01/128.00/63.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 1
[ 131s ] thds: 8 tps: 41.00 qps: 800.99 (r/w/o: 559.99/160.00/81.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 131s ] queue length: 0, concurrency: 0
[ 132s ] thds: 8 tps: 31.00 qps: 620.04 (r/w/o: 434.03/124.01/62.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 0
[ 133s ] thds: 8 tps: 32.00 qps: 640.01 (r/w/o: 448.00/128.00/64.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 133s ] queue length: 0, concurrency: 0
[ 134s ] thds: 8 tps: 37.00 qps: 739.95 (r/w/o: 517.96/147.99/73.99) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 0
[ 135s ] thds: 8 tps: 47.00 qps: 939.98 (r/w/o: 657.98/188.00/94.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 135s ] queue length: 0, concurrency: 0
[ 136s ] thds: 8 tps: 34.00 qps: 680.01 (r/w/o: 476.01/136.00/68.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 0
[ 137s ] thds: 8 tps: 34.00 qps: 680.03 (r/w/o: 476.02/136.01/68.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 137s ] queue length: 0, concurrency: 0
[ 138s ] thds: 8 tps: 32.00 qps: 639.99 (r/w/o: 447.99/128.00/64.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 0
[ 139s ] thds: 8 tps: 46.00 qps: 919.99 (r/w/o: 644.00/184.00/92.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 139s ] queue length: 0, concurrency: 0
[ 140s ] thds: 8 tps: 39.00 qps: 798.95 (r/w/o: 559.96/159.99/78.99) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 1
[ 141s ] thds: 8 tps: 41.00 qps: 820.05 (r/w/o: 574.04/164.01/82.01) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 141s ] queue length: 0, concurrency: 1
[ 142s ] thds: 8 tps: 44.00 qps: 879.99 (r/w/o: 616.00/176.00/88.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 1
[ 143s ] thds: 8 tps: 42.00 qps: 821.00 (r/w/o: 574.00/164.00/83.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 143s ] queue length: 0, concurrency: 0
[ 144s ] thds: 8 tps: 32.00 qps: 639.99 (r/w/o: 447.99/128.00/64.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 0
[ 145s ] thds: 8 tps: 52.00 qps: 1040.03 (r/w/o: 728.02/208.01/104.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 145s ] queue length: 0, concurrency: 0
[ 146s ] thds: 8 tps: 43.00 qps: 860.00 (r/w/o: 602.00/172.00/86.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 0
[ 147s ] thds: 8 tps: 36.00 qps: 719.98 (r/w/o: 503.99/144.00/72.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 147s ] queue length: 0, concurrency: 0
[ 148s ] thds: 8 tps: 41.00 qps: 820.03 (r/w/o: 574.02/164.01/82.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 0
[ 149s ] thds: 8 tps: 50.00 qps: 999.97 (r/w/o: 699.98/199.99/100.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 149s ] queue length: 0, concurrency: 0
[ 150s ] thds: 8 tps: 32.00 qps: 640.02 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 0
[ 151s ] thds: 8 tps: 42.00 qps: 858.98 (r/w/o: 601.98/172.00/85.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 151s ] queue length: 0, concurrency: 1
[ 152s ] thds: 8 tps: 37.00 qps: 721.02 (r/w/o: 504.02/144.00/73.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 0
[ 153s ] thds: 8 tps: 47.00 qps: 939.99 (r/w/o: 657.99/188.00/94.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 153s ] queue length: 0, concurrency: 0
[ 154s ] thds: 8 tps: 46.00 qps: 919.98 (r/w/o: 643.99/184.00/92.00) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 0
[ 155s ] thds: 8 tps: 38.00 qps: 760.03 (r/w/o: 532.02/152.01/76.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 155s ] queue length: 0, concurrency: 0
[ 156s ] thds: 8 tps: 32.00 qps: 677.00 (r/w/o: 476.00/135.00/66.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 2
[ 157s ] thds: 8 tps: 40.00 qps: 782.02 (r/w/o: 546.01/157.00/79.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 157s ] queue length: 0, concurrency: 1
[ 158s ] thds: 8 tps: 40.00 qps: 780.93 (r/w/o: 545.95/155.99/78.99) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 0
[ 159s ] thds: 8 tps: 52.00 qps: 1077.97 (r/w/o: 755.98/215.99/106.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 159s ] queue length: 0, concurrency: 2
[ 160s ] thds: 8 tps: 37.00 qps: 702.08 (r/w/o: 490.06/140.02/72.01) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 0
[ 161s ] thds: 8 tps: 34.00 qps: 698.98 (r/w/o: 489.99/140.00/69.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 161s ] queue length: 0, concurrency: 1
[ 162s ] thds: 8 tps: 56.00 qps: 1105.02 (r/w/o: 773.02/220.00/112.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 1
[ 163s ] thds: 8 tps: 40.00 qps: 796.00 (r/w/o: 557.00/160.00/79.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 163s ] queue length: 0, concurrency: 0
[ 164s ] thds: 8 tps: 48.00 qps: 959.97 (r/w/o: 671.98/191.99/96.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 0
[ 165s ] thds: 8 tps: 41.00 qps: 847.97 (r/w/o: 595.98/167.99/84.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 165s ] queue length: 0, concurrency: 2
[ 166s ] thds: 8 tps: 42.00 qps: 830.95 (r/w/o: 579.96/167.99/82.99) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 1
[ 167s ] thds: 8 tps: 36.00 qps: 701.05 (r/w/o: 490.03/140.01/71.01) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 167s ] queue length: 0, concurrency: 0
[ 168s ] thds: 8 tps: 40.00 qps: 838.02 (r/w/o: 588.02/168.00/82.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 2
[ 169s ] thds: 8 tps: 48.00 qps: 940.99 (r/w/o: 657.99/188.00/95.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 169s ] queue length: 0, concurrency: 1
[ 170s ] thds: 8 tps: 39.00 qps: 761.00 (r/w/o: 532.00/152.00/77.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 0
[ 171s ] thds: 8 tps: 37.00 qps: 739.99 (r/w/o: 517.99/148.00/74.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 171s ] queue length: 0, concurrency: 0
[ 172s ] thds: 8 tps: 36.00 qps: 757.98 (r/w/o: 531.99/152.00/74.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 2
[ 173s ] thds: 8 tps: 42.00 qps: 821.04 (r/w/o: 574.03/164.01/83.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 173s ] queue length: 0, concurrency: 1
[ 174s ] thds: 8 tps: 45.00 qps: 880.95 (r/w/o: 615.97/175.99/88.99) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 0
[ 175s ] thds: 8 tps: 43.00 qps: 860.01 (r/w/o: 602.01/172.00/86.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 175s ] queue length: 0, concurrency: 1
[ 176s ] thds: 8 tps: 41.00 qps: 820.00 (r/w/o: 574.00/164.00/82.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 0
[ 177s ] thds: 8 tps: 39.00 qps: 780.01 (r/w/o: 546.01/156.00/78.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 177s ] queue length: 0, concurrency: 0
[ 178s ] thds: 8 tps: 43.00 qps: 879.03 (r/w/o: 616.02/176.01/87.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 1
[ 179s ] thds: 8 tps: 47.00 qps: 940.01 (r/w/o: 658.01/188.00/94.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 179s ] queue length: 0, concurrency: 1
[ 180s ] thds: 8 tps: 37.00 qps: 720.93 (r/w/o: 503.95/143.99/72.99) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 0
[ 181s ] thds: 8 tps: 40.01 qps: 800.12 (r/w/o: 560.08/160.02/80.01) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 181s ] queue length: 0, concurrency: 0
[ 182s ] thds: 8 tps: 38.00 qps: 759.96 (r/w/o: 531.97/151.99/76.00) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 0
[ 183s ] thds: 8 tps: 54.00 qps: 1079.99 (r/w/o: 755.99/216.00/108.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 183s ] queue length: 0, concurrency: 0
[ 184s ] thds: 8 tps: 30.00 qps: 612.03 (r/w/o: 431.02/120.01/61.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 1
[ 185s ] thds: 8 tps: 46.00 qps: 907.99 (r/w/o: 633.00/184.00/91.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 185s ] queue length: 0, concurrency: 0
[ 186s ] thds: 8 tps: 36.00 qps: 719.96 (r/w/o: 503.97/143.99/72.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 0
[ 187s ] thds: 8 tps: 46.00 qps: 920.00 (r/w/o: 644.00/184.00/92.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 187s ] queue length: 0, concurrency: 0
[ 188s ] thds: 8 tps: 39.00 qps: 791.97 (r/w/o: 556.98/155.99/79.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 1
[ 189s ] thds: 8 tps: 47.00 qps: 928.04 (r/w/o: 647.03/188.01/93.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 189s ] queue length: 0, concurrency: 0
[ 190s ] thds: 8 tps: 45.00 qps: 899.97 (r/w/o: 629.98/179.99/90.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 0
[ 191s ] thds: 8 tps: 44.00 qps: 880.06 (r/w/o: 616.04/176.01/88.01) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 191s ] queue length: 0, concurrency: 0
[ 192s ] thds: 8 tps: 38.00 qps: 778.95 (r/w/o: 545.96/155.99/76.99) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 1
[ 193s ] thds: 8 tps: 39.00 qps: 761.05 (r/w/o: 532.03/152.01/77.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 193s ] queue length: 0, concurrency: 0
[ 194s ] thds: 8 tps: 38.00 qps: 759.98 (r/w/o: 531.99/152.00/76.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 0
[ 195s ] thds: 8 tps: 51.00 qps: 1019.94 (r/w/o: 713.96/203.99/101.99) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 195s ] queue length: 0, concurrency: 1
[ 196s ] thds: 8 tps: 33.00 qps: 660.00 (r/w/o: 462.00/132.00/66.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 0
[ 197s ] thds: 8 tps: 32.00 qps: 640.03 (r/w/o: 448.02/128.01/64.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 197s ] queue length: 0, concurrency: 0
[ 198s ] thds: 8 tps: 48.00 qps: 960.03 (r/w/o: 672.02/192.01/96.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 0
[ 199s ] thds: 8 tps: 40.00 qps: 799.99 (r/w/o: 559.99/160.00/80.00) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 199s ] queue length: 0, concurrency: 0
[ 200s ] thds: 8 tps: 40.00 qps: 800.01 (r/w/o: 560.01/160.00/80.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 0
[ 201s ] thds: 8 tps: 49.00 qps: 979.99 (r/w/o: 685.99/196.00/98.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 201s ] queue length: 0, concurrency: 0
[ 202s ] thds: 8 tps: 31.00 qps: 639.01 (r/w/o: 448.00/128.00/63.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 202s ] queue length: 0, concurrency: 1
[ 203s ] thds: 8 tps: 45.00 qps: 880.96 (r/w/o: 615.97/175.99/89.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 203s ] queue length: 0, concurrency: 1
[ 204s ] thds: 8 tps: 42.00 qps: 840.04 (r/w/o: 588.03/168.01/84.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 204s ] queue length: 0, concurrency: 0
[ 205s ] thds: 8 tps: 42.00 qps: 877.97 (r/w/o: 615.98/175.99/86.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 205s ] queue length: 0, concurrency: 2
[ 206s ] thds: 8 tps: 40.00 qps: 762.01 (r/w/o: 532.00/152.00/78.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 206s ] queue length: 0, concurrency: 0
[ 207s ] thds: 8 tps: 47.00 qps: 978.05 (r/w/o: 686.03/196.01/96.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 207s ] queue length: 0, concurrency: 2
[ 208s ] thds: 8 tps: 50.00 qps: 961.98 (r/w/o: 671.99/192.00/98.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 208s ] queue length: 0, concurrency: 0
[ 209s ] thds: 8 tps: 38.00 qps: 778.96 (r/w/o: 545.97/155.99/77.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 209s ] queue length: 0, concurrency: 1
[ 210s ] thds: 8 tps: 37.00 qps: 721.02 (r/w/o: 504.01/144.00/73.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 210s ] queue length: 0, concurrency: 0
[ 211s ] thds: 8 tps: 30.00 qps: 600.03 (r/w/o: 420.02/120.01/60.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 211s ] queue length: 0, concurrency: 0
[ 212s ] thds: 8 tps: 39.00 qps: 779.94 (r/w/o: 545.96/155.99/77.99) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 212s ] queue length: 0, concurrency: 0
[ 213s ] thds: 8 tps: 34.00 qps: 680.01 (r/w/o: 476.01/136.00/68.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 213s ] queue length: 0, concurrency: 0
[ 214s ] thds: 8 tps: 42.00 qps: 859.02 (r/w/o: 602.01/172.00/85.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 214s ] queue length: 0, concurrency: 1
[ 215s ] thds: 8 tps: 36.00 qps: 701.00 (r/w/o: 490.00/140.00/71.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 215s ] queue length: 0, concurrency: 0
[ 216s ] thds: 8 tps: 33.00 qps: 660.05 (r/w/o: 462.04/132.01/66.01) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 216s ] queue length: 0, concurrency: 0
[ 217s ] thds: 8 tps: 37.00 qps: 739.94 (r/w/o: 517.96/147.99/73.99) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 217s ] queue length: 0, concurrency: 0
[ 218s ] thds: 8 tps: 48.00 qps: 998.02 (r/w/o: 700.01/200.00/98.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 218s ] queue length: 0, concurrency: 2
[ 219s ] thds: 8 tps: 46.00 qps: 881.99 (r/w/o: 615.99/176.00/90.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 219s ] queue length: 0, concurrency: 0
[ 220s ] thds: 8 tps: 38.00 qps: 760.02 (r/w/o: 532.01/152.00/76.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 220s ] queue length: 0, concurrency: 0
[ 221s ] thds: 8 tps: 43.00 qps: 860.01 (r/w/o: 602.01/172.00/86.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 221s ] queue length: 0, concurrency: 0
[ 222s ] thds: 8 tps: 40.00 qps: 799.97 (r/w/o: 559.98/159.99/80.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 222s ] queue length: 0, concurrency: 0
[ 223s ] thds: 8 tps: 38.00 qps: 760.02 (r/w/o: 532.01/152.00/76.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 223s ] queue length: 0, concurrency: 0
[ 224s ] thds: 8 tps: 29.00 qps: 579.99 (r/w/o: 405.99/116.00/58.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 224s ] queue length: 0, concurrency: 0
[ 225s ] thds: 8 tps: 30.00 qps: 618.95 (r/w/o: 433.97/123.99/61.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 225s ] queue length: 0, concurrency: 2
[ 226s ] thds: 8 tps: 48.00 qps: 960.02 (r/w/o: 672.01/192.00/96.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 226s ] queue length: 0, concurrency: 1
[ 227s ] thds: 8 tps: 42.00 qps: 840.06 (r/w/o: 588.04/168.01/84.01) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 227s ] queue length: 0, concurrency: 1
[ 228s ] thds: 8 tps: 35.00 qps: 681.00 (r/w/o: 476.00/136.00/69.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 228s ] queue length: 0, concurrency: 0
[ 229s ] thds: 8 tps: 45.00 qps: 899.94 (r/w/o: 629.96/179.99/89.99) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 229s ] queue length: 0, concurrency: 0
[ 230s ] thds: 8 tps: 40.00 qps: 800.06 (r/w/o: 560.05/160.01/80.01) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 230s ] queue length: 0, concurrency: 0
[ 231s ] thds: 8 tps: 38.00 qps: 760.01 (r/w/o: 532.00/152.00/76.00) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 231s ] queue length: 0, concurrency: 0
[ 232s ] thds: 8 tps: 42.00 qps: 859.03 (r/w/o: 602.02/172.01/85.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 232s ] queue length: 0, concurrency: 1
[ 233s ] thds: 8 tps: 29.00 qps: 579.93 (r/w/o: 405.95/115.99/57.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 233s ] queue length: 0, concurrency: 2
[ 234s ] thds: 8 tps: 37.00 qps: 721.05 (r/w/o: 504.04/144.01/73.01) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 234s ] queue length: 0, concurrency: 0
[ 235s ] thds: 8 tps: 47.00 qps: 939.91 (r/w/o: 657.94/187.98/93.99) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 235s ] queue length: 0, concurrency: 0
[ 236s ] thds: 8 tps: 26.00 qps: 520.05 (r/w/o: 364.04/104.01/52.01) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 236s ] queue length: 0, concurrency: 0
[ 237s ] thds: 8 tps: 49.00 qps: 979.99 (r/w/o: 685.99/196.00/98.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 237s ] queue length: 0, concurrency: 0
[ 238s ] thds: 8 tps: 46.00 qps: 938.99 (r/w/o: 657.99/188.00/93.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 238s ] queue length: 0, concurrency: 1
[ 239s ] thds: 8 tps: 41.00 qps: 801.01 (r/w/o: 560.01/160.00/81.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 239s ] queue length: 0, concurrency: 0
[ 240s ] thds: 8 tps: 42.00 qps: 856.00 (r/w/o: 602.00/169.00/85.00) lat (ms,95%): 17.01 err/s: 1.00 reconn/s: 0.00
[ 240s ] queue length: 0, concurrency: 0
[ 241s ] thds: 8 tps: 43.00 qps: 878.96 (r/w/o: 615.97/175.99/87.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 241s ] queue length: 1, concurrency: 1
[ 242s ] thds: 8 tps: 43.00 qps: 841.04 (r/w/o: 588.03/168.01/85.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 242s ] queue length: 0, concurrency: 0
[ 243s ] thds: 8 tps: 55.00 qps: 1099.95 (r/w/o: 769.97/219.99/110.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 243s ] queue length: 0, concurrency: 0
[ 244s ] thds: 8 tps: 45.00 qps: 900.03 (r/w/o: 630.02/180.01/90.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 244s ] queue length: 0, concurrency: 0
[ 245s ] thds: 8 tps: 49.00 qps: 993.98 (r/w/o: 698.99/196.00/99.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 245s ] queue length: 0, concurrency: 1
[ 246s ] thds: 8 tps: 31.00 qps: 621.03 (r/w/o: 435.02/124.01/62.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 246s ] queue length: 0, concurrency: 1
[ 247s ] thds: 8 tps: 21.00 qps: 423.98 (r/w/o: 293.99/88.00/42.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 247s ] queue length: 0, concurrency: 1
[ 248s ] thds: 8 tps: 38.00 qps: 741.02 (r/w/o: 518.01/148.00/75.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 248s ] queue length: 0, concurrency: 0
[ 249s ] thds: 8 tps: 32.00 qps: 640.00 (r/w/o: 448.00/128.00/64.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 249s ] queue length: 0, concurrency: 0
[ 250s ] thds: 8 tps: 51.00 qps: 1020.02 (r/w/o: 714.01/204.00/102.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 250s ] queue length: 0, concurrency: 0
[ 251s ] thds: 8 tps: 39.99 qps: 799.88 (r/w/o: 559.92/159.98/79.99) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 251s ] queue length: 0, concurrency: 1
[ 252s ] thds: 8 tps: 46.00 qps: 920.09 (r/w/o: 644.06/184.02/92.01) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 252s ] queue length: 0, concurrency: 0
[ 253s ] thds: 8 tps: 44.00 qps: 880.01 (r/w/o: 616.00/176.00/88.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 253s ] queue length: 0, concurrency: 0
[ 254s ] thds: 8 tps: 32.00 qps: 640.01 (r/w/o: 448.00/128.00/64.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 254s ] queue length: 0, concurrency: 0
[ 255s ] thds: 8 tps: 30.00 qps: 600.01 (r/w/o: 420.01/120.00/60.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 255s ] queue length: 0, concurrency: 1
[ 256s ] thds: 8 tps: 48.00 qps: 959.98 (r/w/o: 671.99/192.00/96.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 256s ] queue length: 0, concurrency: 0
[ 257s ] thds: 8 tps: 43.00 qps: 860.01 (r/w/o: 602.01/172.00/86.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 257s ] queue length: 0, concurrency: 0
[ 258s ] thds: 8 tps: 48.00 qps: 978.96 (r/w/o: 685.97/195.99/97.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 258s ] queue length: 0, concurrency: 1
[ 259s ] thds: 8 tps: 42.00 qps: 821.01 (r/w/o: 574.01/164.00/83.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 259s ] queue length: 0, concurrency: 0
[ 260s ] thds: 8 tps: 39.00 qps: 780.01 (r/w/o: 546.01/156.00/78.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 260s ] queue length: 0, concurrency: 0
[ 261s ] thds: 8 tps: 39.00 qps: 792.99 (r/w/o: 557.99/156.00/79.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 261s ] queue length: 0, concurrency: 1
[ 262s ] thds: 8 tps: 39.00 qps: 785.98 (r/w/o: 547.98/160.00/78.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 262s ] queue length: 0, concurrency: 1
[ 263s ] thds: 8 tps: 45.00 qps: 882.07 (r/w/o: 616.05/176.01/90.01) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 263s ] queue length: 0, concurrency: 1
[ 264s ] thds: 8 tps: 35.00 qps: 698.98 (r/w/o: 489.99/140.00/69.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 264s ] queue length: 0, concurrency: 0
[ 265s ] thds: 8 tps: 47.00 qps: 939.97 (r/w/o: 657.98/187.99/94.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 265s ] queue length: 0, concurrency: 0
[ 266s ] thds: 8 tps: 45.00 qps: 899.97 (r/w/o: 629.98/179.99/90.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 266s ] queue length: 0, concurrency: 0
[ 267s ] thds: 8 tps: 36.00 qps: 720.03 (r/w/o: 504.02/144.01/72.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 267s ] queue length: 0, concurrency: 0
[ 268s ] thds: 8 tps: 44.00 qps: 880.00 (r/w/o: 616.00/176.00/88.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 268s ] queue length: 0, concurrency: 0
[ 269s ] thds: 8 tps: 32.00 qps: 640.02 (r/w/o: 448.01/128.00/64.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 269s ] queue length: 0, concurrency: 0
[ 270s ] thds: 8 tps: 43.00 qps: 859.99 (r/w/o: 601.99/172.00/86.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 270s ] queue length: 0, concurrency: 0
[ 271s ] thds: 8 tps: 43.99 qps: 879.89 (r/w/o: 615.92/175.98/87.99) lat (ms,95%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 271s ] queue length: 0, concurrency: 0
[ 272s ] thds: 8 tps: 40.00 qps: 819.10 (r/w/o: 574.07/164.02/81.01) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 272s ] queue length: 0, concurrency: 1
[ 273s ] thds: 8 tps: 36.00 qps: 707.00 (r/w/o: 495.00/140.00/72.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 273s ] queue length: 0, concurrency: 1
[ 274s ] thds: 8 tps: 32.00 qps: 633.99 (r/w/o: 442.99/128.00/63.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 274s ] queue length: 0, concurrency: 0
[ 275s ] thds: 8 tps: 31.00 qps: 620.01 (r/w/o: 434.01/124.00/62.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 275s ] queue length: 0, concurrency: 0
[ 276s ] thds: 8 tps: 36.00 qps: 719.99 (r/w/o: 503.99/144.00/72.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 276s ] queue length: 0, concurrency: 0
[ 277s ] thds: 8 tps: 51.00 qps: 1020.02 (r/w/o: 714.02/204.00/102.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 277s ] queue length: 0, concurrency: 0
[ 278s ] thds: 8 tps: 49.00 qps: 979.96 (r/w/o: 685.97/195.99/98.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 278s ] queue length: 0, concurrency: 0
[ 279s ] thds: 8 tps: 41.00 qps: 820.01 (r/w/o: 574.01/164.00/82.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 279s ] queue length: 0, concurrency: 0
[ 280s ] thds: 8 tps: 31.00 qps: 639.02 (r/w/o: 448.01/128.00/63.00) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 280s ] queue length: 0, concurrency: 1
[ 281s ] thds: 8 tps: 43.00 qps: 841.01 (r/w/o: 588.00/168.00/85.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 281s ] queue length: 0, concurrency: 0
[ 282s ] thds: 8 tps: 52.00 qps: 1039.98 (r/w/o: 727.98/208.00/104.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 282s ] queue length: 0, concurrency: 0
[ 283s ] thds: 8 tps: 40.00 qps: 800.00 (r/w/o: 560.00/160.00/80.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 283s ] queue length: 0, concurrency: 0
[ 284s ] thds: 8 tps: 30.00 qps: 656.97 (r/w/o: 461.98/131.99/63.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 284s ] queue length: 0, concurrency: 3
[ 285s ] thds: 8 tps: 39.00 qps: 723.09 (r/w/o: 504.06/144.02/75.01) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 285s ] queue length: 0, concurrency: 0
[ 286s ] thds: 8 tps: 50.00 qps: 999.92 (r/w/o: 699.94/199.98/99.99) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 286s ] queue length: 0, concurrency: 0
[ 287s ] thds: 8 tps: 30.00 qps: 600.01 (r/w/o: 420.01/120.00/60.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 287s ] queue length: 0, concurrency: 0
[ 288s ] thds: 8 tps: 40.00 qps: 800.04 (r/w/o: 560.03/160.01/80.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 288s ] queue length: 0, concurrency: 0
[ 289s ] thds: 8 tps: 41.00 qps: 819.95 (r/w/o: 573.96/163.99/81.99) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 289s ] queue length: 0, concurrency: 0
[ 290s ] thds: 8 tps: 34.00 qps: 713.03 (r/w/o: 504.02/139.01/70.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 290s ] queue length: 0, concurrency: 2
[ 291s ] thds: 8 tps: 38.00 qps: 726.97 (r/w/o: 503.98/148.99/74.00) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 291s ] queue length: 0, concurrency: 0
[ 292s ] thds: 8 tps: 39.00 qps: 780.01 (r/w/o: 546.01/156.00/78.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 292s ] queue length: 0, concurrency: 0
[ 293s ] thds: 8 tps: 38.00 qps: 759.97 (r/w/o: 531.98/151.99/76.00) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 293s ] queue length: 0, concurrency: 0
[ 294s ] thds: 8 tps: 40.00 qps: 823.03 (r/w/o: 577.02/164.01/82.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 294s ] queue length: 0, concurrency: 2
[ 295s ] thds: 8 tps: 43.00 qps: 836.97 (r/w/o: 584.98/167.99/84.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 295s ] queue length: 0, concurrency: 0
[ 296s ] thds: 8 tps: 44.00 qps: 917.98 (r/w/o: 643.99/184.00/90.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 296s ] queue length: 0, concurrency: 2
[ 297s ] thds: 8 tps: 52.00 qps: 1002.03 (r/w/o: 700.02/200.01/102.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 297s ] queue length: 0, concurrency: 0
[ 298s ] thds: 8 tps: 28.00 qps: 560.01 (r/w/o: 392.01/112.00/56.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 298s ] queue length: 0, concurrency: 0
[ 299s ] thds: 8 tps: 40.00 qps: 799.94 (r/w/o: 559.96/159.99/79.99) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 299s ] queue length: 1, concurrency: 0
[ 300s ] thds: 8 tps: 26.00 qps: 520.04 (r/w/o: 364.02/104.01/52.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 300s ] queue length: 0, concurrency: 0
SQL statistics:
    queries performed:
        read:                            168336
        write:                           48090
        other:                           24046
        total:                           240472
    transactions:                        12022  (40.07 per sec.)
    queries:                             240472 (801.53 per sec.)
    ignored errors:                      2      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0150s
    total number of events:              12022

Latency (ms):
         min:                                    5.15
         avg:                                    9.53
         max:                                  114.67
         95th percentile:                       15.55
         sum:                               114527.94

Threads fairness:
    events (avg/stddev):           1502.7500/2.82
    execution time (avg/stddev):   14.3160/0.11